simpleCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

	
    "(p|p_rgh|G)"
    {
        solver           GAMG;
        tolerance        1e-8;//1e-7;
        relTol           0.001;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }
	
    Phi
    {
        $p;
    }
    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.001;
        nSweeps          2;
    }

    "(T|e|h|nuTilda|k|omega|epsilon)"
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.001;
        nSweeps          2;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    //nCorrectors 3;
	//residualControl
	//{
	//	p				1e-8;
	//	U				1e-8;
	//}

}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.3;//0.5;
    }
    equations
    {
        U               0.3;//0.7;
        "(T|e|h|nuTilda|k|epsilon|omega)"               0.3;//0.7;
        
    }
}

//cache
//{
//    grad(U);
//}

// ************************************************************************* //
